import { Client } from "pg";
import bcrypt from "bcrypt";
import "dotenv/config";

const client = new Client({
  connectionString: process.env.DATABASE_URL,
});

async function main() {
  await client.connect();

  // ===== NEWS =====
  await client.query(`
    INSERT INTO news (title, description, category, "imageUrl", date) VALUES
      ('Открытие нового спортзала', 'В школе появился новый современный зал.', ARRAY['Событие','Школа'], '/images/news1.jpg', '2025-09-01'),
      ('Победа на олимпиаде', 'Ученики заняли 1 место в городской олимпиаде.', ARRAY['Достижения'], '/images/news2.jpg', '2025-10-15'),
      ('Поход в музей', 'Ученики вместе с преподавателями ходили в музей истории', ARRAY['Экскурсия'], '/images/news3.jpg', '2025-11-20');
  `);

  // ===== TEACHERS =====
  await client.query(`
    INSERT INTO teacher (name, position, bio, "photoUrl", subjects) VALUES
      ('Баласанова Ольга Валентиновна', 'Учитель физики', 'Работает в школе более 10 лет.', '/images/teacher1.jpg', ARRAY['Физика']),
      ('Денисова Ольга Владимировна', 'Учитель английского языка', 'Любит путешествия и литературу.', '/images/teacher2.jpg', ARRAY['Английский язык']),
      ('Ерофеева Ирина Николаевна', 'Учитель истории', 'Работает в школе более 10 лет.', '/images/teacher3.jpg', ARRAY['История']),
      ('Калинина Наталья Вячеславовна', 'Учитель русского языка и литературы', 'Любит путешествия и литературу.', '/images/teacher4.jpg', ARRAY['Русский язык и литература']),
      ('Кодацкая Светлана Викторовна', 'Учител биологии', 'Работает в школе более 10 лет.', '/images/teacher5.jpg', ARRAY['Биология']),
      ('Кускова Анжелика Анатольевна', 'Учитель физической культуры', 'Любит путешествия и литературу.', '/images/teacher6.jpg', ARRAY['Физкультура']),
      ('Кулемякина Татьяна Валентиновна', 'Учитель математики', 'Любит путешествия и литературу.', '/images/teacher7.jpg', ARRAY['Математика']);
  `);

  // ===== SCHEDULE =====
  const classes = [
  // ПОНЕДЕЛЬНИК
  { name: '7A', cabinet: '204', weekday: 'Понедельник', lessons: ['Математика','Русский язык','Физика','История','Английский язык','Химия'] },
  { name: '8A', cabinet: '305', weekday: 'Понедельник', lessons: ['Физика','История','Русский язык','Физика','История','Английский язык'] },
  { name: '9А', cabinet: '101', weekday: 'Понедельник', lessons: ['Химия','Биология','История','Русский язык','Физика','История','Английский язык'] },
  { name: '10A', cabinet: '210', weekday: 'Понедельник', lessons: ['Химия','Русский язык','Фзк','История','Английский язык','Химия'] },
  { name: '11A', cabinet: '311', weekday: 'Понедельник', lessons: ['Физика','История','Русский язык','Физика','Химия','Английский язык','История','История'] },

  // ВТОРНИК
  { name: '7А', cabinet: '201', weekday: 'Вторник', lessons: ['Русский язык','Математика','История','География','Биология','Литература','Физкультура'] },
  { name: '8А', cabinet: '202', weekday: 'Вторник', lessons: ['Алгебра','Геометрия','Русский язык','История','Физика','Английский язык','Информатика'] },
  { name: '9А', cabinet: '203', weekday: 'Вторник', lessons: ['Алгебра','Геометрия','Русский язык','Физика','Химия','История','Обществознание','Информатика'] },
  { name: '10А', cabinet: '304', weekday: 'Вторник', lessons: ['Алгебра и начала анализа','Геометрия','Физика','Химия','Русский язык','Литература','Английский язык','Информатика'] },
  { name: '11А', cabinet: '305', weekday: 'Вторник', lessons: ['Алгебра и начала анализа','Физика','Русский язык','Литература','Обществознание','История','Английский язык','Информатика'] },

  // СРЕДА
  { name: '7А', cabinet: '201', weekday: 'Среда', lessons: ['Математика','Русский язык','Биология','История','Музыка','География','Технология'] },
  { name: '8А', cabinet: '202', weekday: 'Среда', lessons: ['Алгебра','Русский язык','Физика','История','География','Биология','Английский язык'] },
  { name: '9А', cabinet: '203', weekday: 'Среда', lessons: ['Алгебра','Геометрия','Химия','Русский язык','Физика','История','Информатика','Обществознание'] },
  { name: '10А', cabinet: '304', weekday: 'Среда', lessons: ['Алгебра и начала анализа','Физика','Химия','Русский язык','Литература','История','Обществознание','Информатика'] },
  { name: '11А', cabinet: '305', weekday: 'Среда', lessons: ['Алгебра и начала анализа','Русский язык','Физика','Химия','История','Обществознание','Английский язык','Информатика'] },

  // ЧЕТВЕРГ
  { name: '7А', cabinet: '201', weekday: 'Четверг', lessons: ['Русский язык','Математика','История','Биология','География','Литература','Физкультура'] },
  { name: '8А', cabinet: '202', weekday: 'Четверг', lessons: ['Алгебра','Геометрия','Физика','Русский язык','История','Информатика','Английский язык'] },
  { name: '9А', cabinet: '203', weekday: 'Четверг', lessons: ['Алгебра','Геометрия','Русский язык','Физика','Химия','История','Обществознание','Информатика'] },
  { name: '10А', cabinet: '304', weekday: 'Четверг', lessons: ['Алгебра и начала анализа','Физика','Русский язык','Химия','Литература','История','Английский язык','Информатика'] },
  { name: '11А', cabinet: '305', weekday: 'Четверг', lessons: ['Алгебра и начала анализа','Физика','Русский язык','Обществознание','История','Английский язык','Информатика','Литература'] },

  // ПЯТНИЦА
  { name: '7А', cabinet: '201', weekday: 'Пятница', lessons: ['Русский язык','Литература','География','Биология','Физкультура','ИЗО'] },
  { name: '8А', cabinet: '202', weekday: 'Пятница', lessons: ['Алгебра','Русский язык','История','Биология','Английский язык','Физкультура'] },
  { name: '9А', cabinet: '203', weekday: 'Пятница', lessons: ['Алгебра','Геометрия','Русский язык','История','Информатика','Физкультура','Обществознание'] },
  { name: '10А', cabinet: '304', weekday: 'Пятница', lessons: ['Алгебра и начала анализа','Русский язык','Литература','История','Английский язык','Физкультура'] },
  { name: '11А', cabinet: '305', weekday: 'Пятница', lessons: ['Алгебра и начала анализа','Русский язык','Обществознание','История','Английский язык','Информатика'] },
];

  for (const cls of classes) {
    const res = await client.query(
      `INSERT INTO class (name, cabinet, weekday) VALUES ($1, $2, $3) RETURNING id`,
      [cls.name, cls.cabinet, cls.weekday]
    );
    const classId = res.rows[0].id;

    for (let i = 0; i < cls.lessons.length; i++) {
      await client.query(
        `INSERT INTO lesson (number, subject, class_id) VALUES ($1, $2, $3)`,
        [i + 1, cls.lessons[i], classId]
      );
    }
  }

  console.log('🔥 База успешно заполнена!');
  await client.end();
}


main().catch(err => {
  console.error(err);
  client.end();
});